{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[8, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[10, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b1_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b1_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b1_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b1_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b1_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b1_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b1_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b1_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b1_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[21, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b2_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b2_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b2_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b2_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b2_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b2_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b2_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b2_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b2_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[38, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 1], [59, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_k_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_k_1_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_1_k_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(15, 1)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(7, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_1_k_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_1_k_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_1_1_k", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 15)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 7)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_2_1_k_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_2_1_k_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_2_1_k", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 15)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 7)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[61, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_2_k_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_2_k_1_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_2_k_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(15, 1)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(7, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[67, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[61, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[61, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[76, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[87, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 1], [116, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[104, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4a_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4a_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_1_k_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_1_k_1_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_1_k_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(15, 1)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(7, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_1_1_k_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_1_1_k_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_1_1_k", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 15)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 7)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_k_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_1_k_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_1_k", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 15)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 7)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[127, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_k_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gcn_middle_layer_2_k_1_bias", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "gcn_middle_layer_2_k_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(15, 1)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(7, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[133, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4a_branch1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4a_branch1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[127, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4a_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4a_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[127, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4a_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4a_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4a_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4a_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4a_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[142, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b1_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 1], [157, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b1_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b1_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b1_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b1_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b1_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b1_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b1_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b1_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[153, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b2_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b2_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b2_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b2_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b2_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b2_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b2_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b2_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b2_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[170, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b3_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0], [189, 0, 0], [190, 0, 1], [191, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b3_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b3_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b3_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b3_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b3_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0], [198, 0, 1], [199, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b3_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b3_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b3_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[187, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b4_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0], [207, 0, 1], [208, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b4_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b4_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b4_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b4_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b4_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0], [215, 0, 1], [216, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b4_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b4_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b4_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[204, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2a_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2a_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2a_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2a_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b5_branch2a", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[221, 0, 0], [222, 0, 0], [223, 0, 0], [224, 0, 1], [225, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b5_branch2a_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b5_branch2a_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b5_branch2a", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2b1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2b1_beta", 
      "attrs": {
        "__lr_mult__": "2.", 
        "__wd_mult__": "0."
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4b5_branch2b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4b5_branch2b1", 
      "attrs": {
        "eps": "1.001e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[229, 0, 0], [230, 0, 0], [231, 0, 0], [232, 0, 1], [233, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4b5_branch2b1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4b5_branch2b1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4b5_branch2b1", 
      "attrs": {
        "cudnn_off": "False", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
